# SetToIdentity Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
Transform1D..::..SetToIdentity Method
Transform1D Class See Also
---
Set this TrfUV to the identity transform
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public Transform1D SetToIdentity()
```

Visual Basic
---
```text
Public Function SetToIdentity As Transform1D
```

Visual C++
---
```text
public:
Transform1D^ SetToIdentity()
```

# ### Return Value
Returns a pointer to "this" Transform1D.
# See Also
Transform1D Class
Autodesk.Revit.DB Namespace